alpha_1.1/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
19484
(
( 0.01104784757 0.0005352693843 -0.0001285198523 )
( 0.01034875028 0.0004655650991 -0.000147955463 )
( 0.01108374633 0.0004636271042 -0.0001225589222 )
( 0.009801791981 0.000413494854 -0.0001549753943 )
( 0.01040221285 0.0004040107597 -0.0001447687828 )
( 0.009796191007 0.0004179954703 -0.0001548396103 )
( 0.01144080237 0.0004247360048 -0.0001050828287 )
( 0.01111405157 0.0003972897248 -0.0001178514358 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
