alpha_1.1/0/pDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
19484
(
2.03224572e-05
2.541767026e-05
1.841160338e-05
2.822661918e-05
2.34330364e-05
2.83789268e-05
1.389649606e-05
1.65482943e-05
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform 0;
    }
    top-wall
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
